In [15]:
import pandas as pd

In [109]:
data = [[1, 1], [2, 2], [3, 3], [4, 3], [5,3], [6,3]]
orders = pd.DataFrame(data, columns=['order_number', 'customer_number']).astype({'order_number':'Int64', 'customer_number':'Int64'})

In [110]:
orders

   order_number  customer_number
0             1                1
1             2                2
2             3                3
3             4                3
4             5                3
5             6                3

In [111]:
orders = orders['customer_number'].value_counts().reset_index()

In [112]:
orders

   customer_number  count
0                3      4
1                1      1
2                2      1

In [113]:
type(orders)

pandas.core.frame.DataFrame

In [114]:
orders.drop('count', axis=1, inplace=True)

In [115]:
orders

   customer_number
0                3
1                1
2                2